# -*- coding: utf-8 -*-
'''
Задание 5.2a

Всё, как в задании 5.2. Но, если пользователь ввел адрес хоста, а не адрес сети,
то надо адрес хоста преобразовать в адрес сети и вывести адрес сети и маску, как в задании 5.2.

Пример адреса сети (все биты хостовой части равны нулю):
* 10.0.1.0/24
* 190.1.0.0/16

Пример адреса хоста:
* 10.0.1.1/24 - хост из сети 10.0.1.0/24
* 10.0.5.1/30 - хост из сети 10.0.5.0/30

Если пользователь ввел адрес 10.0.1.1/24,
вывод должен быть таким:

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

ip_template = '''
   NETWORK:
   {0:<8} {1:<8} {2:<8} {3:<8}
   {0:<08b} {1:<08b} {2:<08b} {3:<08b}
   '''

mask_template = '''
   MASK:
   {0:<8} {1:<8} {2:<8} {3:<8}
   {0:<08b} {1:<08b} {2:<08b} {3:<08b}
   '''

ip_addr = input ("Enter ip network:")

#ip_addr = '10.2.0.0/23'

mask = ip_addr.strip().split('/')[-1]
ip = ip_addr.strip().split('/')[0]

mask_2 = '1'*int(mask) + '0'*(32-int(mask))

subnet1 = int(ip.split('.')[0]) & int(mask_2[0:8], 2)
subnet2 = int(ip.split('.')[1]) & int(mask_2[8:16], 2) 
subnet3 = int(ip.split('.')[2]) & int(mask_2[16:24], 2) 
subnet4 = int(ip.split('.')[3]) & int(mask_2[24:32], 2) 


print(ip_template.format(subnet1,subnet2,subnet3,subnet4))
print(ip_template.format(int(mask_2[0:8],2),int(mask_2[8:16],2),int(mask_2[16:24],2),int(mask_2[24:32],2)))