# -*- coding: utf-8 -*-
'''
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Ограничение: Все задания надо выполнять используя только пройденные темы.
'''
ip_template = '''
   NETWORK:
   {0:<8} {1:<8} {2:<8} {3:<8}
   {0:<08b} {1:<08b} {2:<08b} {3:<08b}
   '''

mask_template = '''
   MASK:
   {0:<8} {1:<8} {2:<8} {3:<8}
   {0:<08b} {1:<08b} {2:<08b} {3:<08b}
   '''

ip_addr = input ("Enter ip network:")

#ip_addr = '10.2.0.0/24'

mask = ip_addr.strip().split('/')[-1]
ip = ip_addr.strip().split('/')[0]

mask_2 = '1'*int(mask) + '0'*(32-int(mask))

print(ip_template.format(int(ip.split('.')[0]),int(ip.split('.')[1]),int(ip.split('.')[2]),int(ip.split('.')[3])))
print(ip_template.format(int(mask_2[0:8],2),int(mask_2[8:16],2),int(mask_2[16:24],2),int(mask_2[24:32],2)))